# # print(
# #     "привет дорогой путешествиник! Сегодня ты заглянешь в ужасающие места! Зачем тебе это надо? --  спросишь ты, я сам незнаю. Я дам тебе поможника из другого мира:  паймон с бутылкой воды из генщина (она будет вам подсказывать)  ")
# #
# # print("——————————————————————— задача 1")
# #
# # print(
# #     "спустя двух часов ходьбы и разговоров про пельмени вы наткнулись на замок, было так тумано что вы еще 10 минут искали вход в замок. вы нашли две двери на которых написано в 1 двери вас поджидает очень голодный оборотень, а за 2 дверью вас поджидает аквариум который вы можете переплыть но он кишит китовыми акулами(вырианты ответа       1         2     (писать именно так как тут показано))")
# #
# # answer = input("в какую дверь ты пойдешь? в 1 или во 2 ?")
# #
# # if answer == "1":
# #     print("Bi cdoxli .""( еcли ты хочешь еще раз пройти игру, то ты можешь еще раз пройти игру)")
# # if answer == "2":
# #     print("молодец ты выбрал правильный путь.")
# #
# # print("——————————————————————— задача 2")
# #
# # print(
# #     "по пути паймон попросила попить глаток воды . ты дал ей бутылку. паймон выпила всю бутылку. ты разозлился и вы идете дальше . ")
# #
# # answer = input(
# #     "вы находиде 4 источника воды: озеро сочныйкактус река и лужа. тебе сильно хоечться попить.что ты выберишь? (вырианты ответа      озеро      лужа       река      сочныйкактус      (писать именно так как тут показано))")
# #
# # if answer == "озеро":
# #     print("Bi otraBilic")
# # if answer == "сочныйкактус":
# #     print("Bi cilno ykalolic")
# # if answer == "лужа":
# #     print("Bi otraBilic")
# # if answer == "река":
# #     print("отлично ! ты напился воды и налил бутылку в воду ")
# #
# # print("——————————————————————— задача 3")
# #
# # print(
# #     "паймон попыталась вырвать у вас бутылку и выпить воду, но ты успел быстро выхватить у нее бутылку. пока ты пытался выхватить бутылку ты упал в яму . так как паймон умеет летать она просто посмеялась над тобой. ты не знал как выбраться и паймон бы тебе не помагла не физический не психологический.    (она бы не смогла тебя проташить на спине или достать где небудь леану или палку чтоб помочешь тебе так как она очень неуклюжая) ")
# #
# # answer = input(
# #     "  к счастью ты нашол 3 тунеля введящии к столу с едой. но тунели были не простые один был с лавой другой с пираньям которым было по 22-21 год и 3 ввел к кактусам которые вы можете обойти но это 5 0 на 50 проц. в какой тунель тебе идти?(вырианты ответа          с лавой        с пираньями         с кактусами  (писать так как тут показано)) ")
# #
# # if answer == "с лавой":
# #     print("вi obroreli")
# # if answer == "с кактусами":
# #     print("Bi ykalolic nogami I ymerli")
# # if answer == "с пираньями":
# # #     print(
# # #         "молодец вы подошли к столу и хвастались перед паймон говоря что вы едите вкусную еду. услышав это паймон взяла вас за шкирку и унесла из тунеля и стала есть еду. вы возмущено ждали паймон возле ямы.")
# # # x = input("введите слово")
# # # temp = x[-1]
# # # print(temp)
# # # print(x.index(temp) + 1)
# # #
# # # print(len(1))p
# # x = "c:\python3\python.exe"
# #
# # print("имя файла", x[11:22])
# # print("расширение", x[-3:])
# # print("имя каталога", x[3:10])
# # print("полный путь к каталогу", x[:10])
# #
# # x1 = x.split("\\")
# # print(x1)
# # print("мя файла", x1[2])
#
# x = "антон"
# print(x.rjust(50))
#
# chapter1 = input("глава1")
# page1 = input("страницы1")
# chapter2 = input("глава1")
# page2 = input("страницы1")
# chapter3 = input("глава1")
# page3 = input("страницы1")

text = "123'456'789"
temp = text.replace("'", "")
number = int(temp)
print(temp)













